				Markdown语法

一.标题

	#一级标题
	##二级标题
	###三级标题
	...
	以此类推，总共六级标题，


二.列表
	
	符号要和文字之间加上一个字符的空格。

	* 无序列表
	* 无序列表
	
	1. 有序列表
	2. 有序列表


三.引用

	>例如这样


四.插入资源
	
	插入图片
	![](url) 
	插入链接
	[链接名](url) 


五.字体

	**粗体**
	*斜体*


六.表格
	
	表格默认为左对齐，在-右边加上:就右对齐。

	dog | bird | cat
	----|------|----
	foo | foo  | foo
	bar | bar  | bar
	baz | baz  | baz


七.代码框

	行内代码:用两个 ` 把中间的代码包裹起来，如 `code`;
	多行代码: 缩进1个制表或者用两个```把中间的代码包裹起来

	```
	#include <stdio.h>
	int main(void)
	{
	    printf("Hello world\n");
	}
	```


八.分割线

	在一行中用三个以上的星号、减号、来建立一个分隔线

	***
	---


九.HTML 原始码
	
	在代码区块里面， & 、 < 和 > 会自动转成 HTML 实体，这样的方式让你非常容易使用 Markdown 插入范例用的 HTML 原始码